Revit 2027 API
ViewSheet.SheetTitleBlockId Property
 The Id of the title block this sheet is associated with.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId SheetTitleBlockId { get; set; }
Public Property SheetTitleBlockId As ElementId
	Get
	Set
public:
property ElementId^ SheetTitleBlockId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member SheetTitleBlockId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ViewSheet Class
Autodesk.Revit.DB Namespace